codeljo/riscv-bare-metal/esp32h2/include/registers.inc
######################################################
# Low-power Clock/Reset (LP_CLKRST)
# (TRM 273)
######################################################
.equ LP_CLKRST_BASE,                        0x600B0400
# Configuration Registers
.equ LP_CLKRST_LP_CLK_CONF_REG,             0x600B0400
.equ LP_CLKRST_LP_CLK_PO_EN_REG,            0x600B0404
.equ LP_CLKRST_LP_CLK_EN_REG,               0x600B0408
.equ LP_CLKRST_LP_RST_EN_REG,               0x600B040C
.equ LP_CLKRST_RESET_CAUSE_REG,             0x600B0410
.equ LP_CLKRST_CPU_RESET_REG,               0x600B0414
.equ LP_CLKRST_FOSC_CNTL_REG,               0x600B0418
.equ LP_CLKRST_CLK_TO_HP_REG,               0x600B0420
.equ LP_CLKRST_LPMEM_FORCE_REG,             0x600B0424
.equ LP_CLKRST_LPPERI_REG,                  0x600B0428
.equ LP_CLKRST_XTAL32K_REG,                 0x600B042C
.equ LP_CLKRST_DATE_REG,                    0x600B07FC

.equ LP_AON_BASE,                           0x600B1000
.equ LP_AON_SYS_CFG_REG,                    0x600B1034
.equ LP_AON_CPUCORE0_CFG_REG,               0x600B1038

.equ LPPERI_BASE,                           0x600B2800
.equ LPPERI_CLK_EN_REG,                     0x600B2800
.equ LPPERI_RESET_EN_REG,                   0x600B2804
######################################################

######################################################
# USB Serial/JTAG Controller (USB_SERIAL_JTAG)
# (TRM 869)
######################################################
.equ USB_SERIAL_JTAG_BASE,                  0x6000F000
# Configuration Registers
.equ USB_SERIAL_JTAG_EP1_REG,               0x6000F000
.equ USB_SERIAL_JTAG_EP1_CONF_REG,          0x6000F004
.equ USB_SERIAL_JTAG_CONF0_REG,             0x6000F018
.equ USB_SERIAL_JTAG_TEST_REG,              0x6000F01C
.equ USB_SERIAL_JTAG_MISC_CONF_REG,         0x6000F044
.equ USB_SERIAL_JTAG_MEM_CONF_REG,          0x6000F048
.equ USB_SERIAL_JTAG_CHIP_RST_REG,          0x6000F04C
.equ USB_SERIAL_JTAG_GET_LINE_CODE_W0_REG,  0x6000F058
.equ USB_SERIAL_JTAG_GET_LINE_CODE_W1_REG,  0x6000F05C
.equ USB_SERIAL_JTAG_CONFIG_UPDATE_REG,     0x6000F060
.equ USB_SERIAL_JTAG_SER_AFIFO_CONFIG_REG,  0x6000F064
# Interrupt Registers
.equ USB_SERIAL_JTAG_INT_RAW_REG,           0x6000F008
.equ USB_SERIAL_JTAG_INT_ST_REG,            0x6000F00C
.equ USB_SERIAL_JTAG_INT_ENA_REG,           0x6000F010
.equ USB_SERIAL_JTAG_INT_CLR_REG,           0x6000F014
# Status Registers
.equ USB_SERIAL_JTAG_JFIFO_ST_REG,          0x6000F020
.equ USB_SERIAL_JTAG_FRAM_NUM_REG,          0x6000F024
.equ USB_SERIAL_JTAG_IN_EP0_ST_REG,         0x6000F028
.equ USB_SERIAL_JTAG_IN_EP1_ST_REG,         0x6000F02C
.equ USB_SERIAL_JTAG_IN_EP2_ST_REG,         0x6000F030
.equ USB_SERIAL_JTAG_IN_EP3_ST_REG,         0x6000F034
.equ USB_SERIAL_JTAG_OUT_EP0_ST_REG,        0x6000F038
.equ USB_SERIAL_JTAG_OUT_EP1_ST_REG,        0x6000F03C
.equ USB_SERIAL_JTAG_OUT_EP2_ST_REG,        0x6000F040
.equ USB_SERIAL_JTAG_SET_LINE_CODE_W0_REG,  0x6000F050
.equ USB_SERIAL_JTAG_SET_LINE_CODE_W1_REG,  0x6000F054
.equ USB_SERIAL_JTAG_BUS_RESET_ST_REG,      0x6000F068
# Version Registers
.equ USB_SERIAL_JTAG_DATE_REG,              0x6000F080
######################################################

######################################################
# LED PWM Controller (LEDC)
# (TRM 949)
######################################################
.equ LEDC_BASE,                        0x60008000
# Configuration Register
.equ LEDC_CH0_CONF0_REG,               0x60008000
.equ LEDC_CH0_CONF1_REG,               0x6000800C
.equ LEDC_CH1_CONF0_REG,               0x60008014
.equ LEDC_CH1_CONF1_REG,               0x60008020
.equ LEDC_CH2_CONF0_REG,               0x60008028
.equ LEDC_CH2_CONF1_REG,               0x60008034
.equ LEDC_CH3_CONF0_REG,               0x6000803C
.equ LEDC_CH3_CONF1_REG,               0x60008048
.equ LEDC_CH4_CONF0_REG,               0x60008050
.equ LEDC_CH4_CONF1_REG,               0x6000805C
.equ LEDC_CH5_CONF0_REG,               0x60008064
.equ LEDC_CH5_CONF1_REG,               0x60008070
.equ LEDC_EVT_TASK_EN0_REG,            0x600081A0
.equ LEDC_EVT_TASK_EN1_REG,            0x600081A4
.equ LEDC_EVT_TASK_EN2_REG,            0x600081A8
.equ LEDC_TIMER0_CMP_REG,              0x600081B0
.equ LEDC_TIMER1_CMP_REG,              0x600081B4
.equ LEDC_TIMER2_CMP_REG,              0x600081B8
.equ LEDC_TIMER3_CMP_REG,              0x600081BC
.equ LEDC_TIMER0_CNT_CAP_REG,          0x600081C0
.equ LEDC_TIMER1_CNT_CAP_REG,          0x600081C4
.equ LEDC_TIMER2_CNT_CAP_REG,          0x600081C8
.equ LEDC_TIMER3_CNT_CAP_REG,          0x600081CC
.equ LEDC_CONF_REG,                    0x600081F0
# Hpoint Register
.equ LEDC_CH0_HPOINT_REG,              0x60008004
.equ LEDC_CH1_HPOINT_REG,              0x60008018
.equ LEDC_CH2_HPOINT_REG,              0x6000802C
.equ LEDC_CH3_HPOINT_REG,              0x60008040
.equ LEDC_CH4_HPOINT_REG,              0x60008054
.equ LEDC_CH5_HPOINT_REG,              0x60008068
# Duty Cycle Register
.equ LEDC_CH0_DUTY_REG,                0x60008008
.equ LEDC_CH0_DUTY_R_REG,              0x60008010
.equ LEDC_CH1_DUTY_REG,                0x6000801C
.equ LEDC_CH1_DUTY_R_REG,              0x60008024
.equ LEDC_CH2_DUTY_REG,                0x60008030
.equ LEDC_CH2_DUTY_R_REG,              0x60008038
.equ LEDC_CH3_DUTY_REG,                0x60008044
.equ LEDC_CH3_DUTY_R_REG,              0x6000804C
.equ LEDC_CH4_DUTY_REG,                0x60008058
.equ LEDC_CH4_DUTY_R_REG,              0x60008060
.equ LEDC_CH5_DUTY_REG,                0x6000806C
.equ LEDC_CH5_DUTY_R_REG,              0x60008074
# Timer Register
.equ LEDC_TIMER0_CONF_REG,             0x600080A0
.equ LEDC_TIMER0_VALUE_REG,            0x600080A4
.equ LEDC_TIMER1_CONF_REG,             0x600080A8
.equ LEDC_TIMER1_VALUE_REG,            0x600080AC
.equ LEDC_TIMER2_CONF_REG,             0x600080B0
.equ LEDC_TIMER2_VALUE_REG,            0x600080B4
.equ LEDC_TIMER3_CONF_REG,             0x600080B8
.equ LEDC_TIMER3_VALUE_REG,            0x600080BC
# Interrupt Register
.equ LEDC_INT_RAW_REG,                 0x600080C0
.equ LEDC_INT_ST_REG,                  0x600080C4
.equ LEDC_INT_ENA_REG,                 0x600080C8
.equ LEDC_INT_CLR_REG,                 0x600080CC
# Gamma RAM Register

# Gamma Configuration Register
.equ LEDC_CH0_GAMMA_CONF_REG,          0x60008180
.equ LEDC_CH1_GAMMA_CONF_REG,          0x60008184
.equ LEDC_CH2_GAMMA_CONF_REG,          0x60008188
.equ LEDC_CH3_GAMMA_CONF_REG,          0x6000818C
.equ LEDC_CH4_GAMMA_CONF_REG,          0x60008190
.equ LEDC_CH5_GAMMA_CONF_REG,          0x60008194
# Version Register
.equ LEDC_DATE_REG,                    0x600081FC
######################################################

######################################################
# Watchdog Timers (WDT)
# (TRM 430)
######################################################
# Configuration Registers
.equ LP_WDT_BASE,                           0x600B1C00
.equ LP_WDT_RWDT_CONFIG0_REG,               0x600B1C00
.equ LP_WDT_RWDT_CONFIG1_REG,               0x600B1C04
.equ LP_WDT_RWDT_CONFIG2_REG,               0x600B1C08
.equ LP_WDT_RWDT_CONFIG3_REG,               0x600B1C0C
.equ LP_WDT_RWDT_CONFIG4_REG,               0x600B1C10
.equ LP_WDT_RWDT_CONFIG5_REG,               0x600B1C14    # TRM (Pre-release v0.5) does not mention this register
.equ LP_WDT_RWDT_FEED_REG,                  0x600B1C18    # TRM incorrect value: 0x600B1C14
.equ LP_WDT_RWDT_WPROTECT_REG,              0x600B1C1C    # TRM incorrect value: 0x600B1C18
.equ LP_WDT_SWD_CONFIG_REG,                 0x600B1C20    # TRM incorrect value: 0x600B1C1C
.equ LP_WDT_SWD_WPROTECT_REG,               0x600B1C24    # TRM incorrect value: 0x600B1C20
.equ LP_WDT_INT_RAW_REG,                    0x600B1C28    # TRM incorrect value: 0x600B1C24
.equ LP_WDT_INT_ST_REG,                     0x600B1C2C    # TRM incorrect value: 0x600B1C28
.equ LP_WDT_INT_ENA_REG,                    0x600B1C30    # TRM incorrect value: 0x600B1C2C
.equ LP_WDT_INT_CLR_REG,                    0x600B1C34    # TRM incorrect value: 0x600B1C30
.equ LP_WDT_DATE_REG,                       0x600B1FFC
######################################################

######################################################
# Random Number Generator (RNG)
# (TRM)
######################################################
.equ LPPERI_RNG_DATA_REG, 0x600B2808
######################################################